<?php
return [
    'title' => 'Пользователи',
    'user'  => [
        'list'             => 'Просмотр списка',
        'create'           => 'Создание',
        'edit'             => 'Редактирование',
        'view_permissions' => 'Просмотр прав',
        'change_roles'     => 'Изменение списка ролей',
        'change_password'  => 'Изменение пароля',
        'delete'           => 'Удаление',
    ],
    'role'  => [
        'list'               => 'Просмотр списка ролей',
        'create'             => 'Создание роли',
        'edit'               => 'Редактирование роли',
        'delete'             => 'Удаление роли',
        'change_permissions' => 'Редактирование набора прав',
    ],
];